# -*- coding: utf-8 -*-
"""Untitled0.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1__SxFEwLwjmMA-uiO0K0x3iXvmCFVIg0
"""

"""
Практическое задание 5-7

Создать вручную и заполнить несколькими строками текстовый файл,
в котором каждая строка должна содержать данные о фирме:
название, форма собственности, выручка, издержки.

Пример строки файла: firm_1 ООО 10000 5000.

Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль.
Если фирма получила убытки, в расчет средней прибыли ее не включать.

Далее реализовать список.
Он должен содержать словарь с фирмами и их прибылями,
а также словарь со средней прибылью.
Если фирма получила убытки, также добавить ее в словарь (со значением убытков).

Пример списка: [{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}].

Итоговый список сохранить в виде json-объекта в соответствующий файл.

Пример json-объекта:
[{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
Подсказка: использовать менеджер контекста.
"""
import json


def clearing_list(elm: list):
    """ Очистка списка от лишних символов """
    r_list = []
    for j in elm:
        if j.find('\n') != -1:
            j = j.replace('\n', '')
        r_list.append(j)
    return r_list


my_dic = {}
summa_dic = {}
summa_list = []
average_profit = 0
count = 0

# Чтение строк из файла и их обработка
with open("my_fileZ7.txt", "r") as my_file:
    print(f"Начата обработка файла {my_file.name}:")
    for f_str in my_file:
        if len(f_str) != 0:
            str_obr = clearing_list((f_str.split(' ')))
            my_dic[str_obr[0]] = int(str_obr[2]) - int(str_obr[3])
            if (int(str_obr[2]) - int(str_obr[3])) > 0:
                average_profit += int(str_obr[2]) - int(str_obr[3])
                count += 1

summa_dic['Средняя прибыль'] = (average_profit / count)
summa_list.append(my_dic)
summa_list.append(summa_dic)

with open('my_fileZ7.json', 'w') as summa_file:
    json.dump(summa_list, summa_file)

# Вывод списка по форме, указанной в задании
print(('*' * 50 + '\n'), summa_list)
print(f"Создан итоговый файл JSON ({summa_file.name}) с итоговым списком фирм и средней прибылью. ")

# Форматированный вывод словаря
print(f"\nСписок фирм и их прибыль:")
for key in my_dic.keys():
    print(f"{key:<10s} - {my_dic[key]:>10d}")
print(f"Средняя прибыль данных компаний составляет: {summa_dic['Средняя прибыль']}")

